# -*- coding: utf-8 -*-
import re
import pandas as pd

words = {'없음': '', '게임중단': '中断', '작전시간': '短暂停', '게임종료': '本节结束', '시간설정': '设定时间', '2점슛성공': '两分球命中', '2점슛시도': '两分球不中',
         '자유투성공': '罚球命中', '자유투시도': '罚球不中', '3점슛성공': '三分球命中', '3점슛시도': '三分球不中', '덩크슛성공': '扣篮命中', '덩크슛시도': '扣篮不中',
         '공격리바운드': '进攻篮板', '수비리바운드': '防守篮板', '어시스트': '助攻', '스틸': '抢断', '블록': '封盖', '턴오버': '失误', '파울자유투': '犯规，对方罚球',
         '파울': '犯规', '팀속공': '球队快攻', '팀리바운드': '全队篮板', 'Illegal Def': '', '굿디펜스': '防守', '팀턴오버': '全队失误', '기타파울': '其他犯规',
         '팀파울': '全队犯规', '엘보우 파울': '肘部犯规', '플레그런트 파울': '三秒违例', '파이팅 파울': '违体犯规', '펀칭 파울"': 'Punching 犯规',
         '퍼스널 파울': '个人犯规', '테크니컬 파울': '技术犯规', '정상교체': '正常换人', '부상': '受伤', '퇴장': '离场', '5반칙': '犯规犯满', '디스퀄리파잉': '取消资格',
         '기타 퇴장': '其他离场', '교체IN': '被换上', '교체OUT': '被换下'}
players = {'양동근': '梁东根', '조성민': '赵成珉', '오용준': '吴龙俊', '김동욱': '金东旭', '한정원': '韩正元', '이현민': '李贤敏', '함지훈': '洪志勋',
           '양희종': '杨熙钟', '김태술': '金泰戌', '송창무': '宋昌武', '정영삼': '郑永三', '신명호': '申明浩', '박상오': '朴常午', '김영환': '金英焕',
           '윤호영': '尹浩英', '김민수': '金民秀', '기승호': '姜胜浩', '강병현': '姜秉贤', '양우섭': '梁友燮', '애런 헤인즈': '艾伦·海恩斯', '문태영': '文泰英',
           '김강선': '金江善', '허일영': '许一英', '박성진': '朴成瑾', '전태풍': '全泰丰', '김우겸': '金宇圭', '변기훈': '卞基勋', '이민재': '李敏载',
           '찰스 로드': '查尔斯路', '송창용': '宋昌勇', '류종현': '柳宗贤', '민성주': '闵成珠', '박찬희': '朴灿熙', '이정현': '李正炫', '박형철': '朴亨哲',
           '김선형': '金善亨', '김현민': '金贤旻', '최진수': '崔镇秀', '김태홍': '金泰弘', '김우람': '金宇蓝', '함준후': '咸俊昊', '김현호': '金贤浩',
           '홍경기': '洪京奇', '김동량': '金东良', '유성호': '柳成浩', '이관희': '李冠熙', '오세근': '吴世根', '정창영': '郑昌永', '장민국': '张民国',
           '최지훈': '崔志勋', '최부경': '崔富京', '김건우': '金健友', '차바위': '车巴伟', '정준원': '郑俊元', '김승원': '金胜元', '최현민': '崔贤民',
           '박지훈': '朴智勋', '김시래': '金时来', '박병우': '朴丙宇', '조상열': '赵相烈', '리온 윌리엄스': '莱昂·威廉姆斯', '라건아': '罗健儿', '박경상': '朴京相',
           '정희재': '郑熙在', '임종일': '林宗日', '김현수': '金贤秀', '장재석': '张在锡', '임동섭': '林东硕', '김지완': '金智万', '김상규': '金相圭',
           '이원대': '李文代', '김윤태': '金允泰', '김민욱': '金敏旭', '유병훈': '刘炳勋', '배병준': '裴炳俊', '김종범': '金钟范', '한희원': '韩熙元',
           '성건주': '成建周', '이대헌': '李大宪', '한상혁': '韩相赫', '문성곤': '文成坤', '김창모': '金昌茂', '김영현': '金英贤', '이대성': '李大成',
           '박재현': '朴在贤', '김종규': '金宗圭', '한호빈': '韩浩彬', '임준수': '林俊秀', '이정제': '李正制', '김민구': '金敏具', '허웅': '许熊', '배수용': '裴秀勇',
           '김수찬': '金秀灿', '김준일': '金俊日', '배강률': '裴刚律', '최승욱': '崔升旭', '주지훈': '朱智勋', '이승현': '李胜贤', '송교창': '宋乔昌',
           '정성우': '郑成友', '박봉진': '朴峰真', '최성모': '崔成模', '이종현': '李宗贤', '김광철': '金光哲', '천기범': '千寄范', '최준용': '崔俊勇',
           '박인태': '朴仁泰', '장문호': '张文浩', '강상재': '姜相在', '김철욱': '金哲旭', '정희원': '郑熙元', '이진욱': '李真旭', '김낙현': '金洛贤',
           '최성원': '崔成元', '전태영': '全泰英', '남영길': '南英吉', '김진용': '金真勇', '안영준': '安英俊', '허훈': '许勋', '김국찬': '金国灿', '양홍석': '梁洪锡',
           '손홍준': '孙洪俊', '윤성원': '尹成元', '유현준': '柳贤俊', '김정년': '金正年', '브랜든 브라운': '布兰登·布朗', '머피 할로웨이': '墨菲·霍洛威',
           '섀넌 쇼터': '香农·肖特', '우동현': '禹东贤', '김성민': '金成民', '서명진': '徐明镇', '강바일': '江巴日', '전현우': '全贤友', '서현석': '徐贤锡',
           '권성진': '权成真', '장태빈': '张泰彬', '정진욱': '郑真旭', '조한진': '赵汉真', '김한솔': '金汉索', '김준형': '金俊亨', '원종훈': '元中勋',
           '이상민': '李相民', '권시현': '权时贤', '변준형': '卞俊迥', '임정헌': '林正宪', '천재민': '千在民', '박준영': '朴俊英', '홍석민': '洪锡民',
           '크리스 맥컬러': '克里斯托弗·麦卡洛', '알 쏜튼': '索顿', '바이런 멀린스': '拜伦·穆伦斯', '캐디 라렌': '科迪拉兰', '칼렙 그린': '加勒·格林',
           '닉 미네라스': '尼克·米纳拉斯', '델로이 제임스': '德利尔·詹姆斯', '자밀 워니': '贾米尔·沃尼', '조던 하워드': '乔丹·霍华德', '자코리 윌리엄스': '杰科里·威廉姆斯',
           '치나누 오누아쿠': '希纳努·奥努阿库', '마이크 해리스': '迈克·哈里斯', '전성환': '全成焕', '이재우': '李在友', '문상옥': '文相宇', '양재혁': '梁在赫',
           '김경원': '金京元', '박찬호': '朴灿浩', '김진영': '金真英', '권혁준': '权赫俊', '김세창': '金世昌', '김무성': '金武成', '박상권': '朴相权', '김훈': '金勋',
           '이동희': '李东熙', '박준은': '朴俊恩', '박건호': '朴建浩', '박정현': '朴正贤', '최진광': '崔真光', '임기웅': '林基文', '곽동기': '郭东基',
           '이진석': '李真锡', '김형빈': '金亨彬', '이윤수': '李允秀', '보리스 사보비치': '鲍里斯·萨沃伯','트로이 길렌워터':'特洛伊  吉伦·沃特','아드리안 유터':'阿德里安·乌特'}


def translate(text):
    text = text.replace('(', '').replace(')', '')
    # for teamname_en, teamname_cn in sorted(nbateams.items(), reverse=True):
    #     teamname_en = teamname_en.lower()
    #     teamname_abbr = teamname_en.split()[-1]
    #     ind = text.find(teamname_abbr)
    #     if ind != -1:
    #         ind = len(teamname_abbr) + ind
    #         text = text.replace(text[0:ind], teamname_cn)
    for word_en, word_cn in sorted(words.items(), key=lambda t: len(t[0]), reverse=True):
        m = re.search(word_en, text)
        if m:
            try:
                num = m.group(1)
            except IndexError:
                word_en = m.group()
                text = text.replace(word_en, word_cn)
            else:
                word_en = m.group()
                if '的' in word_cn:
                    text = text.replace(word_en, ''.join(['的', num, word_cn.replace('的', '')]))
                else:
                    text = text.replace(word_en, ''.join([num, word_cn]))

    text = text.replace('-', ' ')
    for name_en, name_cn in players.items():
        name_en = name_en.lower()
        if name_en in text:
            text = text.replace(name_en, name_cn.replace('-', '·'))

    return text.replace('\t', '').strip().replace(',', ' ')
